Revit 2024 API
NumericRevisionSettings Constructor (NumericRevisionSettings)
 Constructs a new copy of the input NumericRevisionSettings object.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public NumericRevisionSettings(
	NumericRevisionSettings other
)
Visual Basic
Public Sub New ( _
	other As NumericRevisionSettings _
)
Visual C++
public:
NumericRevisionSettings(
	NumericRevisionSettings^ other
)
Parameters
other
Type: Autodesk.Revit.DB.NumericRevisionSettings
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  other is not a valid NumericRevisionSettings.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
NumericRevisionSettings Class
NumericRevisionSettings Overload
Autodesk.Revit.DB Namespace